Revit 2026 API

# TransformAlmostEqual Method

---

Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool AlmostEqual(
	Transform right
)
```
```vb
Public Function AlmostEqual (
	right As Transform
) As Boolean
```
```cpp
public:
bool AlmostEqual(
	Transform^ right
)
```
```fsharp
member AlmostEqual :
        right : Transform -> bool
```

#### Parameters

right Transform
    The transformation to compare with this transformation.

#### Return Value

BooleanTrue if the two transformations are equal; otherwise, false.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the specified transformation is . |

The tolerance is applied memberwise for comparison.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace